raghav-techworks/ST-Embed-Projects/Nucleo_F429xx/Drivers/Inc/stm32NucleoF429xx.h
/*
 * stm32NucleoF429xx.h
 *
 *  Created on: Jan 15, 2024
 *      Author: Raghavender Dornala
 */

#ifndef DRIVERS_INC_STM32NUCLEOF429XX_H_
#define DRIVERS_INC_STM32NUCLEOF429XX_H_

#include<stdint.h>

#define __vo volatile


/*
 *****************************ARM CORTEX-M4 specific registers********************************************
 */
/*
 * NVIC Interrupt Set Enable Registers up to 0xE000E11F
 * (Total 240 interrupts of ISER0 to ISER7 each having 32 interrupts)
 * offset = 0xE000E100 + 0x04 * x (x = 0,1,2...7)
 */
#define NVIC_ISER_BASEADDR				((__vo uint32_t *)0xE000E100)

/* NVIC Clear Set Enable Registers up to 0xE000E19F */
#define NVIC_ICER_BASEADDR				((__vo uint32_t *)0xE000E180)

/* Total 60 priority Registers field for each interrupt (IPR0 to IPR59)
 * Each Register(32 bit) holds 4(8 bits) priorities fields
 * only 4bits are programmed[7-4] in each field.
 * offset = 0xE000E400 + 0x04 * x (x = 0,1,2...59)
 */
#define NVIC_IPR_BASEADDR				((__vo uint32_t *)0xE000E400)		/* NVIC Interrupt Priority Registers */

#define No_OF_PRI_BITS_IMPLEMENTED		4	/*(Each priority number has 8[7-0] bits and implemented only 4 bits [7-4]) */

/*
 * NVIC Interrupt Set Enable Registers (ISERx)
 */
#define NVIC_ISER0						((__vo uint32_t *)0xE000E100)
#define NVIC_ISER1						((__vo uint32_t *)0xE000E104)
#define NVIC_ISER2						((__vo uint32_t *)0xE000E108)
#define NVIC_ISER3						((__vo uint32_t *)0xE000E10C)
#define NVIC_ISER4						((__vo uint32_t *)0xE000E110)
#define NVIC_ISER5						((__vo uint32_t *)0xE000E114)
#define NVIC_ISER6						((__vo uint32_t *)0xE000E118)
#define NVIC_ISER7						((__vo uint32_t *)0xE000E11C)

/*
 * NVIC Interrupt Clear Enable Registers (ICERx)
 */
#define NVIC_ICER0						((__vo uint32_t *)0xE000E180)
#define NVIC_ICER1						((__vo uint32_t *)0xE000E184)
#define NVIC_ICER2						((__vo uint32_t *)0xE000E188)
#define NVIC_ICER3						((__vo uint32_t *)0xE000E18C)
#define NVIC_ICER4						((__vo uint32_t *)0xE000E190)
#define NVIC_ICER5						((__vo uint32_t *)0xE000E194)
#define NVIC_ICER6						((__vo uint32_t *)0xE000E198)
#define NVIC_ICER7						((__vo uint32_t *)0xE000E19C)


/*******************************************END OF ARM CORTEX-M4 specific registers********************************/



/*
 * Base addresses of Memory and SRAM
 * SRAM = DTCM + SRAM1 + SRAM2 + Reserved = 512KB
 */
#define FLASH_BASEADDR			0x08000000U			// 1MB upto 0x081FFFFF
#define SRAM1_BASEADDR			0x20000000U			// 112KB upto 0x2001BFFF
#define SRAM2_BASEADDR			0x2001C000U			// 16KB upto 0x2001FFFF
#define SRAM3_BASEADDR			0x20020000U			// 64KB upto 0x2002FFFF
#define ROM_BASEADDR			0x1FFF0000U			// 30KB upto 0x1FFF77FF

/*
 * AHBx and APBx peripheral base addresses
 */
#define PERIPH_BASEADDR				0x40000000U
#define APB1_PERIPH_BASEADDR		PERIPH_BASEADDR		//upto 0x40007FFF
#define APB2_PERIPH_BASEADDR		0x40010000U			//upto 0x40016BFF
#define AHB1_PERIPH_BASEADDR		0x40020000U			//upto 0x4007FFFF
#define AHB2_PERIPH_BASEADDR		0x50000000U			//upto 0x50060BFF
#define AHB3_PERIPH_BASEADDR		0x60000000U			//upto 0xDFFFFFFF

#define RCC_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x3800)			//upto 0x40023BFF

/*
 * Base addresses of peripherals which are hanging on AHB1 bus
 * AHB1 Bus Clock speed = 216 MHz
 */
#define GPIOA_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x0000)			//upto 0x400203FF
#define GPIOB_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x0400)			//upto 0x400207FF
#define GPIOC_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x0800)			//upto 0x40020BFF
#define GPIOD_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x0C00)			//upto 0x40020FFF
#define GPIOE_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x1000)			//upto 0x400213FF
#define GPIOF_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x1400)			//upto 0x400217FF
#define GPIOG_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x1800)			//upto 0x40021BFF
#define GPIOH_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x1C00)			//upto 0x40021FFF
#define GPIOI_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x2000)			//upto 0x400223FF
#define GPIOJ_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x2400)			//upto 0x400227FF
#define GPIOK_BASEADDR				(AHB1_PERIPH_BASEADDR + 0x2800)			//upto 0x40022BFF

/*
 * Base addresses of peripherals which are hanging on APB1 bus
 * APB1 Bus Clock speed = 54MHz
 */
#define I2C1_BASEADDR				(APB1_PERIPH_BASEADDR + 0x5400)			//upto 0x400057FF
#define I2C2_BASEADDR				(APB1_PERIPH_BASEADDR + 0x5800)			//upto 0x40005BFF
#define I2C3_BASEADDR				(APB1_PERIPH_BASEADDR + 0x5C00)			//upto 0x40005FFF

#define SPI2_BASEADDR				(APB1_PERIPH_BASEADDR + 0x3800)			//upto 0x40003BFF
#define SPI3_BASEADDR				(APB1_PERIPH_BASEADDR + 0x3C00)			//upto 0x40003FFF

#define USART2_BASEADDR				(APB1_PERIPH_BASEADDR + 0x4400)			//upto 0x400047FF
#define USART3_BASEADDR				(APB1_PERIPH_BASEADDR + 0x4800)			//upto 0x40004BFF
#define UART4_BASEADDR				(APB1_PERIPH_BASEADDR + 0x4C00)			//upto 0x40004FFF
#define UART5_BASEADDR				(APB1_PERIPH_BASEADDR + 0x5000)			//upto 0x400053FF
#define UART7_BASEADDR				(APB1_PERIPH_BASEADDR + 0x7800)			//upto 0x40007BFF
#define UART8_BASEADDR				(APB1_PERIPH_BASEADDR + 0x7C00)			//upto 0x40007FFF

/*
 * Base addresses of peripherals which are hanging on APB2 bus
 * APB2 Bus Clock speed = 108MHz
 */
#define EXTI_BASEADDR				(APB2_PERIPH_BASEADDR + 0x3C00)			//upto 0x40013FFF

#define SPI1_BASEADDR				(APB2_PERIPH_BASEADDR + 0x3000)			//upto 0x400133FF
#define SPI4_BASEADDR				(APB2_PERIPH_BASEADDR + 0x3400)			//upto 0x400137FF
#define SPI5_BASEADDR				(APB2_PERIPH_BASEADDR + 0x5000)			//upto 0x400153FF
#define SPI6_BASEADDR				(APB2_PERIPH_BASEADDR + 0x5400)			//upto 0x400157FF

#define SYSCFG_BASEADDR				(APB2_PERIPH_BASEADDR + 0x3800)			//upto 0x40013BFF

#define USART1_BASEADDR				(APB2_PERIPH_BASEADDR + 0x1000)			//upto 0x400113FF
#define USART6_BASEADDR				(APB2_PERIPH_BASEADDR + 0x1400)			//upto 0x400117FF


/*
 * structure for RCC registers
 */
typedef struct
{
	__vo uint32_t CR;				     /* RCC clock control register, 								 Offset = 0x00 */
	__vo uint32_t PLLCFGR;			     /* RCC PLL configuration register,  							 Offset = 0x04 */
	__vo uint32_t CFGR;				     /* RCC clock configuration register, 							 Offset = 0x08 */
	__vo uint32_t CIR;				     /* RCC clock interrupt register, 								 Offset = 0x0C */
	__vo uint32_t AHB1RSTR;			     /* RCC AHB1 peripheral reset register, 						 Offset = 0x10 */
	__vo uint32_t AHB2RSTR;			     /* RCC AHB2 peripheral reset register, 						 Offset = 0x14 */
	__vo uint32_t AHB3RSTR;			     /* RCC AHB3 peripheral reset register, 						 Offset = 0x18*/
		 uint32_t RESERVED0;		     /* Reserved , 													 Offset = 0x1C */
	__vo uint32_t APB1RSTR;			     /* RCC APB1 peripheral reset register, 						 Offset = 0x20 */
	__vo uint32_t APB2RSTR;			     /* RCC APB2 peripheral reset register, 						 Offset = 0x24 */
		 uint32_t RESERVED1[2];	     	 /* Reserved, 													 Offset = 0x28, 0x2C */
	__vo uint32_t AHB1ENR;			     /* RCC AHB1 peripheral clock register, 						 Offset = 0x30 */
	__vo uint32_t AHB2ENR;			     /* RCC AHB2 peripheral clock register, 						 Offset = 0x34 */
	__vo uint32_t AHB3ENR;			     /* RCC AHB3 peripheral clock register, 						 Offset = 0x38 */
		 uint32_t RESERVED2;		     /* Reserved, 													 Offset = 0x3C */
	__vo uint32_t APB1ENR;			     /* RCC APB1 peripheral clock register, 						 Offset = 0x40 */
	__vo uint32_t APB2ENR;			     /* RCC APB2 peripheral clock register, 						 Offset = 0x44 */
		 uint32_t RESERVED3[2];	     	 /* Reserved, 													 Offset = 0x48, 0x4C */
	__vo uint32_t AHB1LPENR;		     /* RCC AHB1 peripheral clock enable in low-power mode register, Offset = 0x50 */
	__vo uint32_t AHB2LPENR;		     /* RCC AHB2 peripheral clock enable in low-power mode register, Offset = 0x54 */
	__vo uint32_t AHB3LPENR;		     /* RCC AHB3 peripheral clock enable in low-power mode register, Offset = 0x58 */
		 uint32_t RESERVED4;		     /* Reserved , 													 Offset = 0x5C */
	__vo uint32_t APB1LPENR;		     /* RCC APB1 peripheral clock enable in low-power mode register, Offset = 0x60 */
	__vo uint32_t APB2LPENR;		     /* RCC APB2 peripheral clock enable in low-power mode register, Offset = 0x64 */
		 uint32_t RESERVED5[2];		     /* Reserved, 													 Offset = 0x68, 0x6C */
	__vo uint32_t BDCR;				     /* RCC backup domain control register, 						 Offset = 0x70 */
	__vo uint32_t CSR;				     /* RCC clock control & status register, 						 Offset = 0x74 */
		 uint32_t RESERVED6[2];		     /* Reserved, 													 Offset = 0x78, 0x7C */
	__vo uint32_t SSCGR;			     /* RCC spread spectrum clock generation register, 				 Offset = 0x80 */
	__vo uint32_t PLLI2SCFGR;		     /* RCC PLLI2S configuration register, 							 Offset = 0x84 */
	__vo uint32_t PLLSAICFGR;		     /* RCC PLLSAI configuration register, 							 Offset = 0x88 */
	__vo uint32_t DCKCFGR1;			     /* RCC dedicated clocks configuration register, 				 Offset = 0x8C */
}RCC_RegDef_t;

