raghav-techworks/ST-Embed-Projects/Nucleo_F429xx/Drivers/Inc/stm32NucleoF429xx.h
/*
 * Structure for EXTI Register
 *
 */
typedef struct
{
	__vo uint32_t EXTI_IMR;				/* Interrupt Mask Register,            offset = 0x00*/
	__vo uint32_t EXTI_EMR;				/* Event Mask Register,                offset = 0x04*/
	__vo uint32_t EXTI_RTSR;			/* Raising Trigger Selection Register, offset = 0x08*/
	__vo uint32_t EXTI_FTSR;			/* Falling Trigger Selection Register, offset = 0x0C*/
	__vo uint32_t EXTI_SWIER;			/* Software Interrupt Event Register,  offset = 0x10*/
	__vo uint32_t EXTI_PR;				/* Pending Register,                   offset = 0x14*/
}EXTI_RegDef_t;

/*
 * Structure for SYSCFG Register
 */
typedef struct
{
	__vo uint32_t SYSCFG_MEMRMP;				/* Memory Remap Register,            			offset = 0x00*/
	__vo uint32_t SYSCFG_PMC;					/* Peripheral Mode Configuration Register,      offset = 0x04*/
	__vo uint32_t SYSCFG_EXTICR[4];				/* External peripheral Configuration Registers, offset = 0x08, 0x0C, 0x10, 0x14*/
	uint32_t SYSCFG_Reserved;
	uint32_t SYSCFG_Reserved2;
	__vo uint32_t SYSCFG_CMPCR;					/* Compensation Cell Control Register,          offset = 0x20*/
}SYSCFG_RegDef_t;


#define RCC			((RCC_RegDef_t *)RCC_BASEADDR)
#define EXTI        ((EXTI_RegDef_t *)EXTI_BASEADDR)
#define SYSCFG      ((SYSCFG_RegDef_t *)SYSCFG_BASEADDR)

/*
 * Clock disable for SYSCFG peripherals
 */
#define SYSCFG_PCLK_EN()				(RCC->APB2ENR |= (1 << 14))
#define SYSCFG_PCLK_DI()				(RCC->APB2ENR &= ~(1 << 14))


/******************************************** WATCHDOG ***************************************/

/* Independent Watchdog(IWDG)
 * The independent watchdog (IWDG) is clocked by its own dedicated low-speed clock (LSI) and
 * thus stays active even if the main clock fails.
 * The IWDG is best suited to applications which require the WD to run as a totally
 * independent process outside the main application, but have lower timing accuracy constraints.
 */

#define IWDG_ENABLE_VALUE				0xCCCC	/* Writing to IWDG_KR, Starts the WD((except if the H/W WD option is selected)) */
#define IWDG_RESET_VALUE				0XFFF   /* Writing to IWDG_RLR, */
#define IWDG_RELOAD_VALUE				0xAAAA	/* Must be written by software at regular intervals to IWDG_KR, otherwise the WD generates a reset when the counter reaches 0 */
#define IWDG_ACCESS_VALUE				0x5555  /* Writing to IWDG_KR, Enable access to the IWDG_PR and IWDG_RLR registers */

/* Status Registers -> IWDG_SR */

#define IWDG_SR_PVU		0				/* Watchdog Prescaler value update, can be updated only when RVU bit is reset.*/
#define IWDG_SR_RVU		1				/* Watchdog counter reload value update, can be updated only when PVU bit is reset.*/

#define IWDG_SR_RESET			0
#define IWDG_SR_SET				1

/* Status Registers -> IWDG_PR */

#define IWDG_PR_DIVIDER_4			0
#define IWDG_PR_DIVIDER_8			1
#define IWDG_PR_DIVIDER_16			2
#define IWDG_PR_DIVIDER_32			3
#define IWDG_PR_DIVIDER_64			4
#define IWDG_PR_DIVIDER_128			5
#define IWDG_PR_DIVIDER_256_6		6
#define IWDG_PR_DIVIDER_256_7		7

/*
 * structure for Independent Watchdog registers
 */
typedef struct
{
	__vo uint32_t IWDG_KR;		/* IWDG Key Register register,	 	Offset = 0x00 */
	__vo uint32_t IWDG_PR;		/* IWDG PreScaler register,			Offset = 0x04 */
	__vo uint32_t IWDG_RLR;		/* IWDG ReLoad register,			Offset = 0x08 */
	__vo uint32_t IWDG_SR;		/* IWDG Status register,			Offset = 0x0C */
}IWDG_RegDef_t;


/* Window Watchdog(WWDG)
 * The window watchdog (WWDG) clock is prescaled from the APB1 clock and
 * has a configurable time-window that can be programmed to detect abnormally late or early application behavior.
 * The WWDG is best suited to applications which require the watchdog to react within an accurate timing window.
 */


/* Early wake-up interrupt flag -> This bit is set by hardware when the counter has reached the value 0x40.
 * It must be cleared by software by writing ‘0’. This bit is also set if the interrupt is not enabled.
 */
#define WWDG_SR_EWIF		0

typedef struct
{
	__vo uint32_t WWDG_CR;		/* IWDG Key Register register,	 	Offset = 0x00 */
	__vo uint32_t WWDG_CFR;		/* IWDG PreScaler register,			Offset = 0x04 */
	__vo uint32_t WWDG_SR;		/* IWDG Status register,			Offset = 0x08 */
}WWDG_RegDef_t;

/******************************************** END OF WATCHDOG ***************************************/


/********************************************GPIO PERIPHERAL***************************************/
/*
 * structure for GPIO peripheral registers
 */
typedef struct
{
	__vo uint32_t MODER;		/* GPIO port mode register,							Offset = 0x00 */
	__vo uint32_t OTYPER;		/* GPIO port output type register,					Offset = 0x04 */
	__vo uint32_t OSPEEDR;		/* GPIO port output speed register,					Offset = 0x08 */
	__vo uint32_t PUPDR;		/* GPIO port pull-up/pull-down register,			Offset = 0x0C */
	__vo uint32_t IDR;			/* GPIO port input data register,					Offset = 0x10 */
	__vo uint32_t ODR;			/* GPIO port output data register,					Offset = 0x14 */
	__vo uint32_t BSRR;			/* GPIO port bit set/reset register,				Offset = 0x18 */
	__vo uint32_t LCKR;			/* GPIO port configuration lock register, 			Offset = 0x1C */
	__vo uint32_t AFRL[2];		/* AFRL[0] = GPIO alternate function low register , Offset = 0x20 and AFRL[1] = GPIO alternate function high register , Offset = 0x24 */
}GPIO_RegDef_t;

/*
 * Assigning base address of each GPIOx to the structure
 */
#define GPIOA		((GPIO_RegDef_t *)GPIOA_BASEADDR)
#define GPIOB		((GPIO_RegDef_t *)GPIOB_BASEADDR)
#define GPIOC		((GPIO_RegDef_t *)GPIOC_BASEADDR)
#define GPIOD		((GPIO_RegDef_t *)GPIOD_BASEADDR)
#define GPIOE		((GPIO_RegDef_t *)GPIOE_BASEADDR)
#define GPIOF		((GPIO_RegDef_t *)GPIOF_BASEADDR)
#define GPIOG		((GPIO_RegDef_t *)GPIOG_BASEADDR)
#define GPIOH		((GPIO_RegDef_t *)GPIOH_BASEADDR)
#define GPIOI		((GPIO_RegDef_t *)GPIOI_BASEADDR)
#define GPIOJ		((GPIO_RegDef_t *)GPIOJ_BASEADDR)
#define GPIOK		((GPIO_RegDef_t *)GPIOK_BASEADDR)

/*
 * Clock enable for GPIO peripheral
 */
#define GPIOA_PCLK_EN()					(RCC->AHB1ENR |= (1 << 0))
#define GPIOB_PCLK_EN()					(RCC->AHB1ENR |= (1 << 1))
#define GPIOC_PCLK_EN()					(RCC->AHB1ENR |= (1 << 2))
#define GPIOD_PCLK_EN()					(RCC->AHB1ENR |= (1 << 3))
#define GPIOE_PCLK_EN()					(RCC->AHB1ENR |= (1 << 4))
#define GPIOF_PCLK_EN()					(RCC->AHB1ENR |= (1 << 5))
#define GPIOG_PCLK_EN()					(RCC->AHB1ENR |= (1 << 6))
#define GPIOH_PCLK_EN()					(RCC->AHB1ENR |= (1 << 7))
#define GPIOI_PCLK_EN()					(RCC->AHB1ENR |= (1 << 8))
#define GPIOJ_PCLK_EN()					(RCC->AHB1ENR |= (1 << 9))
#define GPIOK_PCLK_EN()					(RCC->AHB1ENR |= (1 << 10))

