raghav-techworks/ST-Embed-Projects/Nucleo_F429xx/Drivers/Inc/stm32NucleoF429xx.h
/*
 * Clock disable for GPIO peripherals
 */
#define GPIOA_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 0))
#define GPIOB_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 1))
#define GPIOC_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 2))
#define GPIOD_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 3))
#define GPIOE_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 4))
#define GPIOF_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 5))
#define GPIOG_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 6))
#define GPIOH_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 7))
#define GPIOI_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 8))
#define GPIOJ_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 9))
#define GPIOK_PCLK_DI()					(RCC->AHB1ENR &= ~(1 << 10))

/*
 * Reset GPIOx peripheral
 * this is a technique to execute multiple statements in a single macro
 */
		/*                            1. SET 					    2. RESET*/
#define GPIOA_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 0); RCC->AHB1RSTR &= ~(1 << 0);}while(0)
#define GPIOB_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 1); RCC->AHB1RSTR &= ~(1 << 1);}while(0)
#define GPIOC_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 2); RCC->AHB1RSTR &= ~(1 << 2);}while(0)
#define GPIOD_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 3); RCC->AHB1RSTR &= ~(1 << 3);}while(0)
#define GPIOE_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 4); RCC->AHB1RSTR &= ~(1 << 4);}while(0)
#define GPIOF_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 5); RCC->AHB1RSTR &= ~(1 << 5);}while(0)
#define GPIOG_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 6); RCC->AHB1RSTR &= ~(1 << 6);}while(0)
#define GPIOH_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 7); RCC->AHB1RSTR &= ~(1 << 7);}while(0)
#define GPIOI_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 8); RCC->AHB1RSTR &= ~(1 << 8);}while(0)
#define GPIOJ_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 9); RCC->AHB1RSTR &= ~(1 << 9);}while(0)
#define GPIOK_REG_RESET()			do {RCC->AHB1RSTR |= (1 << 10); RCC->AHB1RSTR &= ~(1 << 10);}while(0)


#define GPIO_BASEADDR_TO_CODE(ADDR)	  ( (ADDR == GPIOA) ? 0 : \
										(ADDR == GPIOB) ? 1 : \
										(ADDR == GPIOC) ? 2 : \
										(ADDR == GPIOD) ? 3 : \
										(ADDR == GPIOE) ? 4 : \
										(ADDR == GPIOF) ? 5 : \
										(ADDR == GPIOG) ? 6 : \
										(ADDR == GPIOH) ? 7 : \
										(ADDR == GPIOI) ? 8 : \
										(ADDR == GPIOJ) ? 9 : \
										(ADDR == GPIOK) ? 10 : 0 )

/*********************************************END OF GPIO PERIPHERAL****************************************/

/******************************************** SPI PERIPHERAL *************************************************/
/*
 * structure for SPI registers
 */
typedef struct
{
	__vo uint32_t SPI_CR1;			/* SPI Control Register 1, 		   offset = 0x00 */
	__vo uint32_t SPI_CR2;			/* SPI Control Register 2,		   offset = 0x04 */
	__vo uint32_t SPI_SR;			/* SPI Status Register,			   offset = 0x08 */
	__vo uint32_t SPI_DR;			/* SPI Data Register, 			   offset = 0x0C */
	__vo uint32_t SPI_CRCPR;		/* SPI CRC Polynomial Register,    offset = 0x10 */
	__vo uint32_t SPI_RxCRCR;		/* SPI RX CRC Register,			   offset = 0x14 */
	__vo uint32_t SPI_TxCRCR;		/* SPI TX CRC Register,			   offset = 0x18 */
	__vo uint32_t SPI_I2SCFGR;		/* SPI I2S Configuration Register, offset = 0x1C */
	__vo uint32_t SPI_I2SPR;		/* SPI I2S prescalar Register,	   offset = 0x20 */
}SPI_RegDef_t;

/*
 * Assigning base address of each SPIx to the structure
 */
#define SPI1			((SPI_RegDef_t *)SPI1_BASEADDR)
#define SPI2			((SPI_RegDef_t *)SPI2_BASEADDR)
#define SPI3			((SPI_RegDef_t *)SPI3_BASEADDR)
#define SPI4			((SPI_RegDef_t *)SPI4_BASEADDR)
#define SPI5			((SPI_RegDef_t *)SPI5_BASEADDR)
#define SPI6			((SPI_RegDef_t *)SPI6_BASEADDR)

/*
 * Clock enable for SPI peripheral
 */
#define SPI1_PCLK_EN()					(RCC->APB2ENR |= (1 << 12))
#define SPI2_PCLK_EN()					(RCC->APB1ENR |= (1 << 14))
#define SPI3_PCLK_EN()					(RCC->APB1ENR |= (1 << 15))
#define SPI4_PCLK_EN()					(RCC->APB2ENR |= (1 << 13))
#define SPI5_PCLK_EN()					(RCC->APB2ENR |= (1 << 20))
#define SPI6_PCLK_EN()					(RCC->APB2ENR |= (1 << 21))

/*
 * Clock Disable for SPI peripheral
 */
#define SPI1_PCLK_DI()					(RCC->APB2ENR &= ~(1 << 12))
#define SPI2_PCLK_DI()					(RCC->APB1ENR &= ~(1 << 14))
#define SPI3_PCLK_DI()					(RCC->APB1ENR &= ~(1 << 15))
#define SPI4_PCLK_DI()					(RCC->APB2ENR &= ~(1 << 13))
#define SPI5_PCLK_DI()					(RCC->APB2ENR &= ~(1 << 20))
#define SPI6_PCLK_DI()					(RCC->APB2ENR &= ~(1 << 21))

/*
 * Reset SPIx peripheral
 * this is a technique to execute multiple statements in a single macro
 */
		/*                            1. SET 					    2. RESET*/
#define SPI1_REG_RESET()			do {RCC->APB2RSTR |= (1 << 12); RCC->APB2RSTR &= ~(1 << 12);}while(0)
#define SPI2_REG_RESET()			do {RCC->APB1RSTR |= (1 << 14); RCC->APB1RSTR &= ~(1 << 14);}while(0)
#define SPI3_REG_RESET()			do {RCC->APB1RSTR |= (1 << 15); RCC->APB1RSTR &= ~(1 << 15);}while(0)
#define SPI4_REG_RESET()			do {RCC->APB2RSTR |= (1 << 13); RCC->APB2RSTR &= ~(1 << 13);}while(0)
#define SPI5_REG_RESET()			do {RCC->APB2RSTR |= (1 << 20); RCC->APB2RSTR &= ~(1 << 20);}while(0)
#define SPI6_REG_RESET()			do {RCC->APB2RSTR |= (1 << 21); RCC->APB2RSTR &= ~(1 << 21);}while(0)

/******************************************** END OF SPI PERIPHERAL *************************************************/


/******************************************** I2C PERIPHERAL *************************************************/

/*
 * structure for I2C registers
 */
typedef struct
{
	__vo uint32_t I2C_CR1;			/* I2C Control Register 1, 		   		offset = 0x00 */
	__vo uint32_t I2C_CR2;			/* I2C Control Register 2,		   		offset = 0x04 */
	__vo uint32_t I2C_OAR1;			/* I2C Own Address 1 Register,	   		offset = 0x08 */
	__vo uint32_t I2C_OAR2;			/* I2C Own Address 2 Register, 	   		offset = 0x0C */
	__vo uint32_t I2C_DR;			/* I2C Data Register,            		offset = 0x10 */
	__vo uint32_t I2C_SR1;			/* I2C Status Register 1,		   		offset = 0x14 */
	__vo uint32_t I2C_SR2;			/* I2C Status Register 2,				offset = 0x18 */
	__vo uint32_t I2C_CCR;			/* I2C Clock Control Register, 			offset = 0x1C */
	__vo uint32_t I2C_TRISE;		/* I2C TRISE Register,					offset = 0x20 */
	__vo uint32_t I2C_FLTR;			/* I2C FLTR Register,	   				offset = 0x24 */
}I2C_RegDef_t;

